u-blox/evb-ant-1/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_RST_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_RST_GPIO_PIN                                      9U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_RST_GPIO_PIN_MASK                         (1U << 9U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_RST_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_RST_PIN                                           9U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_RST_PIN_MASK                              (1U << 9U)   /*!< PORT pin mask */

/* GPIO_SD_B0_01 (coord J3), SD1_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_CLK_PERIPHERAL                                 USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_CLK_SIGNAL                                  usdhc_clk   /*!< Signal name */

/* GPIO_SD_B0_00 (coord J4), SD1_CMD */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_CMD_PERIPHERAL                                 USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_CMD_SIGNAL                                  usdhc_cmd   /*!< Signal name */

/* GPIO_SD_B0_02 (coord J1), SD1_D0 */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_D0_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_D0_SIGNAL                                  usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SD1_D0_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_SD_B0_03 (coord K1), SD1_D1 */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_D1_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_D1_SIGNAL                                  usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SD1_D1_CHANNEL                                         1U   /*!< Signal channel */

/* GPIO_SD_B0_04 (coord H2), SD1_D2 */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_D2_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_D2_SIGNAL                                  usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SD1_D2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_SD_B0_05 (coord J2), SD1_D3 */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_D3_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_D3_SIGNAL                                  usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SD1_D3_CHANNEL                                         3U   /*!< Signal channel */

/* GPIO_AD_B1_00 (coord J11), ANT_BXX_CTS */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_CTS_PERIPHERAL                            LPUART2   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_CTS_SIGNAL                                  CTS_B   /*!< Signal name */

/* GPIO_AD_B1_01 (coord K11), ANT_BXX_RTS */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_RTS_PERIPHERAL                            LPUART2   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_RTS_SIGNAL                                  RTS_B   /*!< Signal name */

/* GPIO_AD_B1_03 (coord M12), ANT_BXX_RX */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_RX_PERIPHERAL                             LPUART2   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_RX_SIGNAL                                      RX   /*!< Signal name */

/* GPIO_AD_B1_02 (coord L11), ANT_BXX_TX */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_TX_PERIPHERAL                             LPUART2   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_TX_SIGNAL                                      TX   /*!< Signal name */

/* GPIO_AD_B1_12 (coord H12), ANT_BXX_CS */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_CS_PERIPHERAL                              LPSPI3   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_CS_SIGNAL                                    PCS0   /*!< Signal name */

/* GPIO_AD_B1_15 (coord J14), ANT_BXX_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_CLK_PERIPHERAL                             LPSPI3   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_CLK_SIGNAL                                    SCK   /*!< Signal name */

/* GPIO_AD_B1_13 (coord H11), ANT_BXX_MISO */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_MISO_PERIPHERAL                            LPSPI3   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_MISO_SIGNAL                                   SDI   /*!< Signal name */

/* GPIO_AD_B1_14 (coord G12), ANT_BXX_MOSI */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_MOSI_PERIPHERAL                            LPSPI3   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_MOSI_SIGNAL                                   SDO   /*!< Signal name */

/* GPIO_AD_B1_09 (coord M13), ANT_BXX_RST */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_RST_PERIPHERAL                              GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_RST_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ANT_BXX_RST_CHANNEL                                   25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ANT_BXX_RST_GPIO                                    GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_RST_GPIO_PIN                                  25U   /*!< GPIO pin number */
#define BOARD_INITPINS_ANT_BXX_RST_GPIO_PIN_MASK                     (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ANT_BXX_RST_PORT                                    GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_RST_PIN                                       25U   /*!< PORT pin number */
#define BOARD_INITPINS_ANT_BXX_RST_PIN_MASK                          (1U << 25U)   /*!< PORT pin mask */

/* GPIO_B1_12 (coord D13), ANT_BXX_SW1 */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_SW1_PERIPHERAL                              GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_SW1_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ANT_BXX_SW1_CHANNEL                                   28U   /*!< Signal channel */

