u-blox/evb-ant-1/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ANT_BXX_SW1_GPIO                                    GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_SW1_GPIO_PIN                                  28U   /*!< GPIO pin number */
#define BOARD_INITPINS_ANT_BXX_SW1_GPIO_PIN_MASK                     (1U << 28U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ANT_BXX_SW1_PORT                                    GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_SW1_PIN                                       28U   /*!< PORT pin number */
#define BOARD_INITPINS_ANT_BXX_SW1_PIN_MASK                          (1U << 28U)   /*!< PORT pin mask */

/* GPIO_AD_B0_00 (coord M14), ANT_BXX_SW2 */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_SW2_PERIPHERAL                              GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_SW2_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ANT_BXX_SW2_CHANNEL                                    0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ANT_BXX_SW2_GPIO                                    GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_SW2_GPIO_PIN                                   0U   /*!< GPIO pin number */
#define BOARD_INITPINS_ANT_BXX_SW2_GPIO_PIN_MASK                      (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ANT_BXX_SW2_PORT                                    GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_SW2_PIN                                        0U   /*!< PORT pin number */
#define BOARD_INITPINS_ANT_BXX_SW2_PIN_MASK                           (1U << 0U)   /*!< PORT pin mask */

/* GPIO_AD_B1_10 (coord L13), ANT_BXX_GPIO1 */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_GPIO1_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_GPIO1_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ANT_BXX_GPIO1_CHANNEL                                 26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ANT_BXX_GPIO1_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_GPIO1_GPIO_PIN                                26U   /*!< GPIO pin number */
#define BOARD_INITPINS_ANT_BXX_GPIO1_GPIO_PIN_MASK                   (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ANT_BXX_GPIO1_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_GPIO1_PIN                                     26U   /*!< PORT pin number */
#define BOARD_INITPINS_ANT_BXX_GPIO1_PIN_MASK                        (1U << 26U)   /*!< PORT pin mask */

/* GPIO_AD_B1_11 (coord J13), ANT_BXX_GPIO2 */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_GPIO2_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_GPIO2_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ANT_BXX_GPIO2_CHANNEL                                 27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ANT_BXX_GPIO2_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_GPIO2_GPIO_PIN                                27U   /*!< GPIO pin number */
#define BOARD_INITPINS_ANT_BXX_GPIO2_GPIO_PIN_MASK                   (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ANT_BXX_GPIO2_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_GPIO2_PIN                                     27U   /*!< PORT pin number */
#define BOARD_INITPINS_ANT_BXX_GPIO2_PIN_MASK                        (1U << 27U)   /*!< PORT pin mask */

/* GPIO_AD_B1_08 (coord H13), ANT_BXX_GPIO3 */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_GPIO3_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_GPIO3_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ANT_BXX_GPIO3_CHANNEL                                 24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ANT_BXX_GPIO3_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_GPIO3_GPIO_PIN                                24U   /*!< GPIO pin number */
#define BOARD_INITPINS_ANT_BXX_GPIO3_GPIO_PIN_MASK                   (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ANT_BXX_GPIO3_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_GPIO3_PIN                                     24U   /*!< PORT pin number */
#define BOARD_INITPINS_ANT_BXX_GPIO3_PIN_MASK                        (1U << 24U)   /*!< PORT pin mask */

/* GPIO_EMC_36 (coord C3), ANT_BXX_UART_MUX */
/* Routed pin properties */
#define BOARD_INITPINS_ANT_BXX_UART_MUX_PERIPHERAL                         GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_ANT_BXX_UART_MUX_SIGNAL                           gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ANT_BXX_UART_MUX_CHANNEL                              22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ANT_BXX_UART_MUX_GPIO                               GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_UART_MUX_GPIO_PIN                             22U   /*!< GPIO pin number */
#define BOARD_INITPINS_ANT_BXX_UART_MUX_GPIO_PIN_MASK                (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ANT_BXX_UART_MUX_PORT                               GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ANT_BXX_UART_MUX_PIN                                  22U   /*!< PORT pin number */
#define BOARD_INITPINS_ANT_BXX_UART_MUX_PIN_MASK                     (1U << 22U)   /*!< PORT pin mask */

/* GPIO_SD_B1_00 (coord L5), MAYA_PDN */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_PDN_PERIPHERAL                                 GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_PDN_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MAYA_PDN_CHANNEL                                       0U   /*!< Signal channel */

