u-blox/evb-ant-1/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MAYA_PDN_GPIO                                       GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MAYA_PDN_GPIO_PIN                                      0U   /*!< GPIO pin number */
#define BOARD_INITPINS_MAYA_PDN_GPIO_PIN_MASK                         (1U << 0U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MAYA_PDN_PORT                                       GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MAYA_PDN_PIN                                           0U   /*!< PORT pin number */
#define BOARD_INITPINS_MAYA_PDN_PIN_MASK                              (1U << 0U)   /*!< PORT pin mask */

/* GPIO_EMC_04 (coord F2), MAYA_BT_W_H */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_BT_W_H_PERIPHERAL                              GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_BT_W_H_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MAYA_BT_W_H_CHANNEL                                    4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MAYA_BT_W_H_GPIO                                    GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MAYA_BT_W_H_GPIO_PIN                                   4U   /*!< GPIO pin number */
#define BOARD_INITPINS_MAYA_BT_W_H_GPIO_PIN_MASK                      (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MAYA_BT_W_H_PORT                                    GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MAYA_BT_W_H_PIN                                        4U   /*!< PORT pin number */
#define BOARD_INITPINS_MAYA_BT_W_H_PIN_MASK                           (1U << 4U)   /*!< PORT pin mask */

/* GPIO_EMC_21 (coord C1), MAYA_BT_W_D */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_BT_W_D_PERIPHERAL                              GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_BT_W_D_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MAYA_BT_W_D_CHANNEL                                   21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MAYA_BT_W_D_GPIO                                    GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MAYA_BT_W_D_GPIO_PIN                                  21U   /*!< GPIO pin number */
#define BOARD_INITPINS_MAYA_BT_W_D_GPIO_PIN_MASK                     (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MAYA_BT_W_D_PORT                                    GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MAYA_BT_W_D_PIN                                       21U   /*!< PORT pin number */
#define BOARD_INITPINS_MAYA_BT_W_D_PIN_MASK                          (1U << 21U)   /*!< PORT pin mask */

/* GPIO_EMC_27 (coord A2), MAYA_BT_RESET */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_BT_RESET_PERIPHERAL                            GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_BT_RESET_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MAYA_BT_RESET_CHANNEL                                 27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MAYA_BT_RESET_GPIO                                  GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MAYA_BT_RESET_GPIO_PIN                                27U   /*!< GPIO pin number */
#define BOARD_INITPINS_MAYA_BT_RESET_GPIO_PIN_MASK                   (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MAYA_BT_RESET_PORT                                  GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MAYA_BT_RESET_PIN                                     27U   /*!< PORT pin number */
#define BOARD_INITPINS_MAYA_BT_RESET_PIN_MASK                        (1U << 27U)   /*!< PORT pin mask */

/* GPIO_EMC_28 (coord D1), MAYA_WLAN_W_H */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_WLAN_W_H_PERIPHERAL                            GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_WLAN_W_H_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MAYA_WLAN_W_H_CHANNEL                                 28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MAYA_WLAN_W_H_GPIO                                  GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MAYA_WLAN_W_H_GPIO_PIN                                28U   /*!< GPIO pin number */
#define BOARD_INITPINS_MAYA_WLAN_W_H_GPIO_PIN_MASK                   (1U << 28U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MAYA_WLAN_W_H_PORT                                  GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MAYA_WLAN_W_H_PIN                                     28U   /*!< PORT pin number */
#define BOARD_INITPINS_MAYA_WLAN_W_H_PIN_MASK                        (1U << 28U)   /*!< PORT pin mask */

/* GPIO_EMC_09 (coord C2), MAYA_WLAN_W_D */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_WLAN_W_D_PERIPHERAL                            GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_WLAN_W_D_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MAYA_WLAN_W_D_CHANNEL                                  9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MAYA_WLAN_W_D_GPIO                                  GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MAYA_WLAN_W_D_GPIO_PIN                                 9U   /*!< GPIO pin number */
#define BOARD_INITPINS_MAYA_WLAN_W_D_GPIO_PIN_MASK                    (1U << 9U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MAYA_WLAN_W_D_PORT                                  GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MAYA_WLAN_W_D_PIN                                      9U   /*!< PORT pin number */
#define BOARD_INITPINS_MAYA_WLAN_W_D_PIN_MASK                         (1U << 9U)   /*!< PORT pin mask */

