u-blox/evb-ant-1/board/pin_mux.h
/* GPIO_EMC_18 (coord B2), MAYA_WLAN_RESET */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_WLAN_RESET_PERIPHERAL                          GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_WLAN_RESET_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MAYA_WLAN_RESET_CHANNEL                               18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MAYA_WLAN_RESET_GPIO                                GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MAYA_WLAN_RESET_GPIO_PIN                              18U   /*!< GPIO pin number */
#define BOARD_INITPINS_MAYA_WLAN_RESET_GPIO_PIN_MASK                 (1U << 18U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MAYA_WLAN_RESET_PORT                                GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MAYA_WLAN_RESET_PIN                                   18U   /*!< PORT pin number */
#define BOARD_INITPINS_MAYA_WLAN_RESET_PIN_MASK                      (1U << 18U)   /*!< PORT pin mask */

/* GPIO_EMC_25 (coord D2), MAYA_TX */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_TX_PERIPHERAL                                LPUART6   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_EMC_26 (coord B3), MAYA_RX */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_RX_PERIPHERAL                                LPUART6   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_EMC_29 (coord E1), MAYA_RTS */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_RTS_PERIPHERAL                               LPUART6   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_RTS_SIGNAL                                     RTS_B   /*!< Signal name */

/* GPIO_EMC_30 (coord C6), MAYA_CTS */
/* Routed pin properties */
#define BOARD_INITPINS_MAYA_CTS_PERIPHERAL                               LPUART6   /*!< Peripheral name */
#define BOARD_INITPINS_MAYA_CTS_SIGNAL                                     CTS_B   /*!< Signal name */

/* GPIO_EMC_15 (coord B1), NINA_CTS */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_CTS_PERIPHERAL                               LPUART3   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_CTS_SIGNAL                                     CTS_B   /*!< Signal name */

/* GPIO_EMC_16 (coord A5), NINA_RTS */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_RTS_PERIPHERAL                               LPUART3   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_RTS_SIGNAL                                     RTS_B   /*!< Signal name */

/* GPIO_EMC_14 (coord B6), NINA_RX */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_RX_PERIPHERAL                                LPUART3   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_EMC_13 (coord A6), NINA_TX */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_TX_PERIPHERAL                                LPUART3   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_EMC_01 (coord F3), NINA_CS */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_CS_PERIPHERAL                                 LPSPI2   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_CS_SIGNAL                                       PCS0   /*!< Signal name */

/* GPIO_EMC_00 (coord E3), NINA_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_CLK_PERIPHERAL                                LPSPI2   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_CLK_SIGNAL                                       SCK   /*!< Signal name */

/* GPIO_EMC_03 (coord G4), NINA_MISO */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_MISO_PERIPHERAL                                GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_MISO_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_NINA_MISO_CHANNEL                                      3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NINA_MISO_GPIO                                      GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_NINA_MISO_GPIO_PIN                                     3U   /*!< GPIO pin number */
#define BOARD_INITPINS_NINA_MISO_GPIO_PIN_MASK                        (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_NINA_MISO_PORT                                      GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_NINA_MISO_PIN                                          3U   /*!< PORT pin number */
#define BOARD_INITPINS_NINA_MISO_PIN_MASK                             (1U << 3U)   /*!< PORT pin mask */

/* GPIO_EMC_02 (coord F4), NINA_MOSI */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_MOSI_PERIPHERAL                                GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_MOSI_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_NINA_MOSI_CHANNEL                                      2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NINA_MOSI_GPIO                                      GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_NINA_MOSI_GPIO_PIN                                     2U   /*!< GPIO pin number */
#define BOARD_INITPINS_NINA_MOSI_GPIO_PIN_MASK                        (1U << 2U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_NINA_MOSI_PORT                                      GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_NINA_MOSI_PIN                                          2U   /*!< PORT pin number */
#define BOARD_INITPINS_NINA_MOSI_PIN_MASK                             (1U << 2U)   /*!< PORT pin mask */

/* GPIO_EMC_22 (coord F1), NINA_RST */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_RST_PERIPHERAL                                 GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_RST_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_NINA_RST_CHANNEL                                      22U   /*!< Signal channel */

