u-blox/evb-ant-1/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NINA_RST_GPIO                                       GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_NINA_RST_GPIO_PIN                                     22U   /*!< GPIO pin number */
#define BOARD_INITPINS_NINA_RST_GPIO_PIN_MASK                        (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_NINA_RST_PORT                                       GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_NINA_RST_PIN                                          22U   /*!< PORT pin number */
#define BOARD_INITPINS_NINA_RST_PIN_MASK                             (1U << 22U)   /*!< PORT pin mask */

/* GPIO_EMC_24 (coord D3), NINA_SW1 */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_SW1_PERIPHERAL                                 GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_SW1_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_NINA_SW1_CHANNEL                                      24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NINA_SW1_GPIO                                       GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_NINA_SW1_GPIO_PIN                                     24U   /*!< GPIO pin number */
#define BOARD_INITPINS_NINA_SW1_GPIO_PIN_MASK                        (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_NINA_SW1_PORT                                       GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_NINA_SW1_PIN                                          24U   /*!< PORT pin number */
#define BOARD_INITPINS_NINA_SW1_PIN_MASK                             (1U << 24U)   /*!< PORT pin mask */

/* GPIO_EMC_31 (coord C5), NINA_SW2 */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_SW2_PERIPHERAL                                 GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_SW2_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_NINA_SW2_CHANNEL                                      31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NINA_SW2_GPIO                                       GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_NINA_SW2_GPIO_PIN                                     31U   /*!< GPIO pin number */
#define BOARD_INITPINS_NINA_SW2_GPIO_PIN_MASK                        (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_NINA_SW2_PORT                                       GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_NINA_SW2_PIN                                          31U   /*!< PORT pin number */
#define BOARD_INITPINS_NINA_SW2_PIN_MASK                             (1U << 31U)   /*!< PORT pin mask */

/* GPIO_EMC_17 (coord A4), NINA_GPIO1 */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_GPIO1_PERIPHERAL                               GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_GPIO1_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_NINA_GPIO1_CHANNEL                                    17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NINA_GPIO1_GPIO                                     GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_NINA_GPIO1_GPIO_PIN                                   17U   /*!< GPIO pin number */
#define BOARD_INITPINS_NINA_GPIO1_GPIO_PIN_MASK                      (1U << 17U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_NINA_GPIO1_PORT                                     GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_NINA_GPIO1_PIN                                        17U   /*!< PORT pin number */
#define BOARD_INITPINS_NINA_GPIO1_PIN_MASK                           (1U << 17U)   /*!< PORT pin mask */

/* GPIO_EMC_20 (coord A3), NINA_GPIO2 */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_GPIO2_PERIPHERAL                               GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_GPIO2_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_NINA_GPIO2_CHANNEL                                    20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NINA_GPIO2_GPIO                                     GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_NINA_GPIO2_GPIO_PIN                                   20U   /*!< GPIO pin number */
#define BOARD_INITPINS_NINA_GPIO2_GPIO_PIN_MASK                      (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_NINA_GPIO2_PORT                                     GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_NINA_GPIO2_PIN                                        20U   /*!< PORT pin number */
#define BOARD_INITPINS_NINA_GPIO2_PIN_MASK                           (1U << 20U)   /*!< PORT pin mask */

/* GPIO_EMC_19 (coord B4), NINA_GPIO3 */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_GPIO3_PERIPHERAL                               GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_GPIO3_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_NINA_GPIO3_CHANNEL                                    19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NINA_GPIO3_GPIO                                     GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_NINA_GPIO3_GPIO_PIN                                   19U   /*!< GPIO pin number */
#define BOARD_INITPINS_NINA_GPIO3_GPIO_PIN_MASK                      (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_NINA_GPIO3_PORT                                     GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_NINA_GPIO3_PIN                                        19U   /*!< PORT pin number */
#define BOARD_INITPINS_NINA_GPIO3_PIN_MASK                           (1U << 19U)   /*!< PORT pin mask */

/* GPIO_EMC_33 (coord C4), NINA_UART_MUX */
/* Routed pin properties */
#define BOARD_INITPINS_NINA_UART_MUX_PERIPHERAL                            GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_NINA_UART_MUX_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_NINA_UART_MUX_CHANNEL                                 19U   /*!< Signal channel */

