u-blox/evb-ant-1/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_NINA_UART_MUX_GPIO                                  GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_NINA_UART_MUX_GPIO_PIN                                19U   /*!< GPIO pin number */
#define BOARD_INITPINS_NINA_UART_MUX_GPIO_PIN_MASK                   (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_NINA_UART_MUX_PORT                                  GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_NINA_UART_MUX_PIN                                     19U   /*!< PORT pin number */
#define BOARD_INITPINS_NINA_UART_MUX_PIN_MASK                        (1U << 19U)   /*!< PORT pin mask */

/* GPIO_B1_01 (coord B11), MCU_SW1 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_SW1_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_SW1_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_SW1_CHANNEL                                       17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_SW1_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_SW1_GPIO_PIN                                      17U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_SW1_GPIO_PIN_MASK                         (1U << 17U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_SW1_PORT                                        GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_SW1_PIN                                           17U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_SW1_PIN_MASK                              (1U << 17U)   /*!< PORT pin mask */

/* GPIO_B1_02 (coord C11), MCU_SW2 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_SW2_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_SW2_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_SW2_CHANNEL                                       18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_SW2_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_SW2_GPIO_PIN                                      18U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_SW2_GPIO_PIN_MASK                         (1U << 18U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_SW2_PORT                                        GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_SW2_PIN                                           18U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_SW2_PIN_MASK                              (1U << 18U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), MCU_SW3 */
/* Routed pin properties */
#define BOARD_INITPINS_MCU_SW3_PERIPHERAL                                  GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_MCU_SW3_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_MCU_SW3_CHANNEL                                       30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MCU_SW3_GPIO                                        GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_MCU_SW3_GPIO_PIN                                      30U   /*!< GPIO pin number */
#define BOARD_INITPINS_MCU_SW3_GPIO_PIN_MASK                         (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_MCU_SW3_PORT                                        GPIO7   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_MCU_SW3_PIN                                           30U   /*!< PORT pin number */
#define BOARD_INITPINS_MCU_SW3_PIN_MASK                              (1U << 30U)   /*!< PORT pin mask */

/* GPIO_B1_00 (coord A11), USER_LED_01 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED_01_PERIPHERAL                              GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED_01_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED_01_CHANNEL                                   16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED_01_GPIO                                    GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED_01_GPIO_PIN                                  16U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED_01_GPIO_PIN_MASK                     (1U << 16U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_USER_LED_01_PORT                                    GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_USER_LED_01_PIN                                       16U   /*!< PORT pin number */
#define BOARD_INITPINS_USER_LED_01_PIN_MASK                          (1U << 16U)   /*!< PORT pin mask */

/* GPIO_B1_15 (coord B14), USER_LED_02 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED_02_PERIPHERAL                              GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED_02_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED_02_CHANNEL                                   31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED_02_GPIO                                    GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED_02_GPIO_PIN                                  31U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED_02_GPIO_PIN_MASK                     (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_USER_LED_02_PORT                                    GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_USER_LED_02_PIN                                       31U   /*!< PORT pin number */
#define BOARD_INITPINS_USER_LED_02_PIN_MASK                          (1U << 31U)   /*!< PORT pin mask */

